; domain
(define (domain health-care-1)
    (:requirements :strips :typing :negative-preconditions)

    (:types
        medical-unit box content robot patient - locatable
        robot-box robot-patient - robot
        location - object
    )

    (:predicates
        ; location predicates
        (at ?o - locatable ?l - location)
        (connected ?l1 - location ?l2 - location)
        ; box predicates
        (empty ?b - box)
        (box-has-content ?b - box ?c - content)
        ; content predicates
        (content-available ?c - content ?l - location)
        (unit-needs-content ?u - medical-unit ?c - content)
        (unit-has-content ?u - medical-unit ?c - content)
        ; patient predicates
        (patient-needs-unit ?p - patient ?u - medical-unit)
        (patient-at-unit ?p - patient ?u - medical-unit)
        ; robot-box predicates
        (robot-has-box ?r - robot-box ?b - box)
        ; robot-patient predicates
        (robot-has-patient ?r - robot-patient ?p - patient)
    )

    (:action pick-up-box
        :parameters (?r - robot-box ?b - box ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?b ?l)

            ; check that the robot is not already loaded with another box => here a robot can carry only one box at a time ; CHECK 
            ; (can be also done with a predicate ad hot as "can-carry-box")
            (not (exists
                    (?b2 - box)
                    (robot-has-box ?r ?b2)))

            ; check that the box is not already loaded with a robot ; CHECK 
            (not (exists
                    (?r2 - robot-box)
                    (robot-has-box ?r2 ?b)))
        )
        :effect (and
            (robot-has-box ?r ?b)
        )
    )

    (:action pick-up-patient
        :parameters (?r - robot-patient ?p - patient ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?p ?l)

            ; check that the robot is not already loaded with another patient => here a robot can carry only one patient at a time ; CHECK
            ; (can be also done with a predicate ad hot as "can-carry-patient")
            (not (exists
                    (?p2 - patient)
                    (robot-has-patient ?r ?p2)))
            
            ; check that the patient is not already loaded with a robot ; CHECK
            (not (exists
                    (?r2 - robot-patient)
                    (robot-has-patient ?r2 ?p)))
        )
        :effect (and
            (robot-has-patient ?r ?p)
        )
    )
    

    (:action fill-box
        :parameters (?r - robot-box ?b - box ?c - content ?l - location)
        :precondition (and
            (empty ?b)
            (at ?r ?l)
            (at ?b ?l)
            (content-available ?c ?l)
            (robot-has-box ?r ?b)
        )
        :effect (and
            (not (empty ?b))
            (box-has-content ?b ?c)
            (not (content-available ?c ?l)) ; basically this means that the content is no longer available at the warehouse 
        )
    )

    (:action move-robot
        :parameters (?r - robot ?from - location ?to - location)
        :precondition (and
            (at ?r ?from)
            (connected ?from ?to)
        )
        :effect (and
            (at ?r ?to)
            (not (at ?r ?from))
            ; Move box if robot is carrying one
            (forall
                (?b - box)
                (when
                    (robot-has-box ?r ?b)
                    (and
                        (at ?b ?to)
                        (not (at ?b ?from))
                    )
                )
            )
            ; Move patient if robot is carrying one
            (forall
                (?p - patient)
                (when
                    (robot-has-patient ?r ?p)
                    (and
                        (at ?p ?to)
                        (not (at ?p ?from))
                    )
                )
            )
        )
    )

    (:action deliver-content
        :parameters (?r - robot-box ?b - box ?u - medical-unit ?c - content ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?u ?l)
            (robot-has-box ?r ?b)
            (box-has-content ?b ?c)   
            (unit-needs-content ?u ?c) ; the predicate "unit-needs-content" is an extra check to avoid delivering content to a unit that does not need it, so to avoid extra moves
        )
        :effect (and
            (unit-has-content ?u ?c)
            (not (unit-needs-content ?u ?c))
            (not (box-has-content ?b ?c))
            (not (robot-has-box ?r ?b)) ; robot is not carrying the box anymore : robot is free to carry another box or to reuse the same box
            (empty ?b)
            (at ?b ?l) ; box is empty and at the location (can be reused)
        )
    )

    (:action deliver-patient
        :parameters (?r - robot-patient ?p - patient ?u - medical-unit ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?p ?l)
            (at ?u ?l)
            (patient-needs-unit ?p ?u)
            (robot-has-patient ?r ?p)
        )
        :effect (and
            (patient-at-unit ?p ?u)
            (not (patient-needs-unit ?p ?u))
            (not (robot-has-patient ?r ?p))
        )

    )
)

; problem
(define (problem p1-health-care-1)
    (:domain health-care-1)
    (:objects
        box1 box2 - box
        robot-box1 - robot-box
        robot-patient1 - robot-patient
        warehouse area1 area2 corridor1 - location
        unit1 unit2 - medical-unit
        bandage aspirine scalpel - content
        patient1 patient2 - patient
    )

    (:init
        ; Locations
        (connected warehouse corridor1)
        (connected corridor1 warehouse)
        (connected corridor1 area1)
        (connected area1 corridor1)
        (connected corridor1 area2)
        (connected area2 corridor1)
        
        ; Initial positions
        (at box1 warehouse)
        (at box2 warehouse)
        
        (at robot-box1 warehouse)
        (at robot-patient1 warehouse)
        
        (at unit1 area1)
        (at unit2 area2)

        (at patient1 corridor1)
        (at patient2 area1)
        
        ; Initial states
        (empty box1)
        (empty box2)
        
        (content-available bandage warehouse)
        (content-available aspirine warehouse)
        (content-available scalpel warehouse)
        
        (unit-needs-content unit1 bandage)
        (unit-needs-content unit1 aspirine)
        (unit-needs-content unit2 scalpel)

        (patient-needs-unit patient1 unit1)
        (patient-needs-unit patient2 unit2)
    
    )

    (:goal
        (and
            (unit-has-content unit1 bandage)
            (unit-has-content unit1 aspirine)
            (unit-has-content unit2 scalpel)

            (patient-at-unit patient1 unit1)
            (patient-at-unit patient2 unit2)
        )
    )
)

; plan
1. (move-robot robot-patient1 warehouse corridor1)
   deleted: (at robot-patient1 warehouse)
   added: (at robot-patient1 corridor1)
   goals met: 0 of 5
2. (pick-up-patient robot-patient1 patient1 corridor1)
   added: (robot-has-patient robot-patient1 patient1)
   goals met: 0 of 5
3. (move-robot robot-patient1 corridor1 area1)
   deleted: (at robot-patient1 corridor1) (at patient1 corridor1)
   added: (at robot-patient1 area1) (at patient1 area1)
   goals met: 0 of 5
4. (deliver-patient robot-patient1 patient1 unit1 area1)
   deleted: (patient-needs-unit patient1 unit1) (robot-has-patient robot-patient1 patient1)
   added: (patient-at-unit patient1 unit1)
   goals met: 1 of 5
5. (pick-up-patient robot-patient1 patient2 area1)
   added: (robot-has-patient robot-patient1 patient2)
   goals met: 1 of 5
6. (move-robot robot-patient1 area1 corridor1)
   deleted: (at robot-patient1 area1) (at patient2 area1)
   added: (at robot-patient1 corridor1) (at patient2 corridor1)
   goals met: 1 of 5
7. (move-robot robot-patient1 corridor1 area2)
   deleted: (at robot-patient1 corridor1) (at patient2 corridor1)
   added: (at robot-patient1 area2) (at patient2 area2)
   goals met: 1 of 5
8. (deliver-patient robot-patient1 patient2 unit2 area2)
   deleted: (patient-needs-unit patient2 unit2) (robot-has-patient robot-patient1 patient2)
   added: (patient-at-unit patient2 unit2)
   goals met: 2 of 5
9. (pick-up-box robot-box1 box1 warehouse)
   added: (robot-has-box robot-box1 box1)
   goals met: 2 of 5
10. (fill-box robot-box1 box1 aspirine warehouse)
   deleted: (empty box1) (content-available aspirine warehouse)
   added: (box-has-content box1 aspirine)
   goals met: 2 of 5
11. (move-robot robot-box1 warehouse corridor1)
   deleted: (at robot-box1 warehouse) (at box1 warehouse)
   added: (at robot-box1 corridor1) (at box1 corridor1)
   goals met: 2 of 5
12. (move-robot robot-box1 corridor1 area1)
   deleted: (at robot-box1 corridor1) (at box1 corridor1)
   added: (at robot-box1 area1) (at box1 area1)
   goals met: 2 of 5
13. (deliver-content robot-box1 box1 unit1 aspirine area1)
   deleted: (unit-needs-content unit1 aspirine) (box-has-content box1 aspirine) (robot-has-box robot-box1 box1)
   added: (unit-has-content unit1 aspirine) (empty box1)
   goals met: 3 of 5
14. (pick-up-box robot-box1 box1 area1)
   added: (robot-has-box robot-box1 box1)
   goals met: 3 of 5
15. (move-robot robot-box1 area1 corridor1)
   deleted: (at robot-box1 area1) (at box1 area1)
   added: (at robot-box1 corridor1) (at box1 corridor1)
   goals met: 3 of 5
16. (move-robot robot-box1 corridor1 warehouse)
   deleted: (at robot-box1 corridor1) (at box1 corridor1)
   added: (at robot-box1 warehouse) (at box1 warehouse)
   goals met: 3 of 5
17. (fill-box robot-box1 box1 bandage warehouse)
   deleted: (empty box1) (content-available bandage warehouse)
   added: (box-has-content box1 bandage)
   goals met: 3 of 5
18. (move-robot robot-box1 warehouse corridor1)
   deleted: (at robot-box1 warehouse) (at box1 warehouse)
   added: (at robot-box1 corridor1) (at box1 corridor1)
   goals met: 3 of 5
19. (move-robot robot-box1 corridor1 area1)
   deleted: (at robot-box1 corridor1) (at box1 corridor1)
   added: (at robot-box1 area1) (at box1 area1)
   goals met: 3 of 5
20. (deliver-content robot-box1 box1 unit1 bandage area1)
   deleted: (unit-needs-content unit1 bandage) (box-has-content box1 bandage) (robot-has-box robot-box1 box1)
   added: (unit-has-content unit1 bandage) (empty box1)
   goals met: 4 of 5
21. (move-robot robot-box1 area1 corridor1)
   deleted: (at robot-box1 area1)
   added: (at robot-box1 corridor1)
   goals met: 4 of 5
22. (move-robot robot-box1 corridor1 warehouse)
   deleted: (at robot-box1 corridor1)
   added: (at robot-box1 warehouse)
   goals met: 4 of 5
23. (pick-up-box robot-box1 box2 warehouse)
   added: (robot-has-box robot-box1 box2)
   goals met: 4 of 5
24. (fill-box robot-box1 box2 scalpel warehouse)
   deleted: (empty box2) (content-available scalpel warehouse)
   added: (box-has-content box2 scalpel)
   goals met: 4 of 5
25. (move-robot robot-box1 warehouse corridor1)
   deleted: (at robot-box1 warehouse) (at box2 warehouse)
   added: (at robot-box1 corridor1) (at box2 corridor1)
   goals met: 4 of 5
26. (move-robot robot-box1 corridor1 area2)
   deleted: (at robot-box1 corridor1) (at box2 corridor1)
   added: (at robot-box1 area2) (at box2 area2)
   goals met: 4 of 5
27. (deliver-content robot-box1 box2 unit2 scalpel area2)
   deleted: (unit-needs-content unit2 scalpel) (box-has-content box2 scalpel) (robot-has-box robot-box1 box2)
   added: (unit-has-content unit2 scalpel) (empty box2)
   goals met: 5 of 5
